import type { Alchemist, Color } from './types';

const a = (name: string, title: string, color1: Color, color2: Color, effects: string[]): Alchemist => {
  return {
    name,
    title,
    color1,
    color2,
    effects,
  };
}

const alchemists: Alchemist[] = [
  a('アーシャ', 'MARIA of Dusk', 'B', 'Y', ['大きな回復量	', '会心の出来	', '回復量上昇	']),
  a('イクセル', '戦う料理人', 'Y', 'P', ['魔防の祝福', '氷の呪詛', '突耐性上昇']),
  a('ヴァレリア', '過去に夢を求めし者', 'R', 'B', ['剛力の祝福', '火の祝福', '与ダメージ上昇']),
  a('ヴェイン', '願いを叶える力', 'B', 'G', ['雷の祝福', '雷の盾', '氷耐性上昇']),
  a('エスティ', '頼れる受付嬢', 'P', 'B', ['斬の呪詛', '火の盾', '物理耐性上昇']),
  a('クーデリア', '貴族令嬢', 'B', 'P', ['打の呪詛', '氷の盾', '与ダメージ上昇']),
  a('コルネリア', 'ノーミルクノーライフ', 'G', 'B', ['剛力の呪詛', '破壊力上昇', 'スキル威力上昇']),
  a('シャリステラ', '族長の娘', 'B', 'Y', ['守護の祝福', '魔力の呪詛', '魔法ブレイクダメージ上昇']),
  a('ソフィー', '百科繚乱フロネシス', 'G', 'B', ['魔力の呪詛', '魔力の祝福', '物理耐性上昇【D】']),
  a('タオ', '学者のタマゴ', 'Y', 'B', ['打の祝福', '全体回復ボーナス', '物理ダメージ上昇']),
  a('テス', '兎耳トラブルメーカー', 'R', 'Y', ['突の盾', '大きな回復量', '単体回復量上昇']),
  a('トトリ', '強き母に憧れる少女', 'P', 'G', ['大きな回復量', '魔防の祝福', '回復量上昇']),
  a('マリオン', '開発班の班長', 'P', 'R', ['物防の祝福', '火の祝福', '雷耐性上昇']),
  a('マリー', 'Lovely Bomber', 'P', 'G', ['魔力の祝福', '剛力の呪詛	', 'ブレイクダメージ上昇	']),
  a('メルル', 'パワフルプリンセス', 'G', 'R', ['突の祝福', '風の盾', '魔法ダメージ上昇']),
  a('モニカ', 'モニカオンステージ', 'R', 'B', ['突の祝福', '物防の祝福', '魔法耐性上昇【D】']),
  a('ライザ', 'One Summer Story', 'G', 'R', ['魔防の祝福', '風の祝福', '火ダメージ上昇']),
  a('リンカ', '班長補佐', 'G', 'Y', ['火の祝福', '物防の祝福', '魔法耐性上昇']),
  a('レスナ', '未来に夢を求めし者', 'Y', 'G', ['魔力の祝福', '単体回復ボーナス', '魔法ダメージ上昇']),
  a('レント', '剛腕戦士', 'G', 'P', ['打の盾', '雷の祝福', '物理耐性上昇']),
  a('ロロナ', '五ツ星パイマスター', 'R', 'G', ['魔力の呪詛', '追い打ち強化', '氷ダメージ上昇']),
  //a('', '', '', '', ['', '', '']),
];

export default alchemists;
