import type { Alchemist, Color } from './types';

const a = (name: string, title: string, colors: [Color, Color], effects: string[]): Alchemist => {
  return {
    name,
    title,
    colors,
    effects,
  };
}

const alchemists: Alchemist[] = [
  // a('ライザ', 'One Summer Story', ['G', 'R'], ['魔防の祝福', '風の祝福', '火ダメージ上昇']),
  a('ヴァレリア', '過去に夢を求めし者', ['R', 'B'], ['剛力の祝福', '火の祝福', '与ダメージ上昇']),
  a('ソフィー', '百科繚乱フロネシス', ['G', 'B'], ['魔力の呪詛', '魔力の祝福', '物理耐性上昇【D】']),
  a('コルネリア', 'ノーミルクノーライフ', ['G', 'B'], ['剛力の呪詛', '破壊力上昇', 'スキル威力上昇']),
  a('レント', '剛腕戦士', ['G', 'P'], ['打の盾', '雷の祝福', '物理耐性上昇']),
  a('リンカ', '班長補佐', ['G', 'Y'], ['火の祝福', '物防の祝福', '魔法耐性上昇']),
  a('ロロナ', '五ツ星パイマスター', ['R', 'G'], ['魔力の呪詛', '追い打ち強化', '氷ダメージ上昇']),
  a('テス', '兎耳トラブルメーカー', ['R', 'Y'], ['突の盾', '大きな回復量', '単体回復量上昇']),
  a('モニカ', 'モニカオンステージ', ['R', 'B'], ['突の祝福', '物防の祝福', '魔法耐性上昇【D】']),
  a('レスナ', '未来に夢を求めし者', ['Y', 'G'], ['魔力の祝福', '単体回復ボーナス', '魔法ダメージ上昇']),
  a('イクセル', '戦う料理人', ['Y', 'P'], ['魔防の祝福', '氷の呪詛', '突耐性上昇']),
  a('タオ', '学者のタマゴ', ['Y', 'B'], ['打の祝福', '全体回復ボーナス', '物理ダメージ上昇']),
  a('シャリステラ', '族長の娘', ['B', 'Y'], ['守護の祝福', '魔力の呪詛', '魔法ブレイクダメージ上昇']),
  //a('', '', ['', ''], ['', '', '']),
  //a('', '', ['', ''], ['', '', '']),
  //a('', '', ['', ''], ['', '', '']),
  //a('', '', ['', ''], ['', '', '']),
];

export default alchemists;
