import { Recipe, Color, ItemCategory } from './types';

const c = ItemCategory;

const r = (series: string, category: ItemCategory, name: string, colors: [Color, Color, Color], ingredients: [string, number][]): Recipe => {
  return {
    series,
    category,
    name,
    colors,
    ingredients: ingredients.map(([material, count]) => ({ material, count })),
  };
}

const recipes = [
  r('1', c.HEAL, 'うに袋', ['B', 'Y', 'R'], [
    ['うに', 5],
  ]),
  r('1', c.HEAL, 'ヒーリングサルヴ', ['B', 'P', 'Y'], [
    ['トーン', 5],
  ]),
  r('1', c.WEAPON, 'フランベルジュ', ['B', 'Y', 'R'], [
    ['うに', 5],
    ['トーン', 5],
  ]),
  r('1', c.ARMOUR, '旅人のベスト', ['Y', 'R', 'G'], [
    ['うに', 5],
    ['トーン', 5],
  ]),
  r('1', c.JEWELRY, 'うに型チャーム', ['B', 'Y', 'R'], [
    ['うに', 5],
    ['若木の枝葉', 15],
  ]),
  r('1', c.ATTACK, 'フラム', ['B', 'R', 'G'], [
    ['ハチの巣', 15],
    ['うに', 5],
  ]),
  r('1', c.HEAL, 'ドライビスク', ['P', 'Y', 'R'], [
    ['コゲクサ', 1],
    ['パチパチ水', 1],
  ]),
  r('1', c.BUFF, '魔女の秘薬', ['B', 'P', 'Y'], [
    ['ナナシ草', 5],
    ['植物エキス', 5],
    ['サルディン', 5],
  ]),
  r('1', c.WEAPON, 'お手製の杖', ['B', 'P', 'Y'], [
    ['若木の枝葉', 5],
    ['ハチの巣', 5],
    ['ナナシ草', 5],
  ]),
  r('1', c.JEWELRY, 'ウサギのシッポ', ['P', 'Y', 'G'], [
    ['正体不明の原石', 10],
    ['チョウチョウウオ', 1],
  ]),
  r('1', c.ARMOUR, '混合毛のシャツ', ['P', 'Y', 'G'], [
    ['シロヒメクサ', 5],
    ['植物エキス', 5],
    ['サルディン', 5],
  ]),
  r('1', c.WEAPON, '蒼穹の弓', ['P', 'Y', 'G'], [
    ['カブトバッタ', 5],
    ['若木の枝葉', 5],
    ['ハチの巣', 5],
  ]),
  r('1', c.ARMOUR, 'ノーブルチュニック', ['B', 'R', 'G'], [
    ['ナナシ草', 5],
    ['シロヒメクサ', 5],
    ['正体不明の原石', 5],
  ]),
  r('1', c.JEWELRY, 'エナジーペンダント', ['B', 'R', 'G'], [
    ['食毒草', 1],
    ['キラービー', 1],
    ['ビリビリ水', 1],
  ]),
  r('1', c.BUFF, 'ナントカの秘薬', ['B', 'P', 'Y'], [
    ['怨嗟の叫び', 10],
    ['植物エキス', 5],
  ]),
  r('2', c.ATTACK, 'ドナーストーン', ['B', 'Y', 'R'], [
    ['コベリナイト', 30],
  ]),
  r('2', c.HEAL, 'ヒーリングベル', ['Y', 'R', 'G'], [
    ['セイタカトーン', 3],
    ['マジックグラス', 3],
    ['銀のハチの巣', 3],
  ]),
  r('2', c.WEAPON, '軽い鉄の杖', ['Y', 'R', 'G'], [
    ['白灰砂', 10],
    ['エメラルドグラス', 1],
  ]),
  r('2', c.ARMOUR, 'レザープロテクター', ['Y', 'R', 'G'], [
    ['貯ミツアリ', 10],
    ['苦ミミズ', 1],
  ]),
  r('2', c.JEWELRY, 'モノクログラス', ['B', 'Y', 'G'], [
    ['フェスト', 10],
    ['震える結晶', 1],
  ]),
  r('2', c.DEBUFF, '暗黒水', ['B', 'R', 'G'], [
    ['雲海の隠れ家', 1],
    ['闇の雫', 2],
    ['風船魚', 1],
  ]),
  r('2', c.BUFF, '素朴な焼き菓子', ['B', 'Y', 'G'], [
    ['ペントナイト', 20],
    ['自然油', 20],
  ]),
  r('2', c.WEAPON, '鉄鉤', ['B', 'P', 'G'], [
    ['コベリナイト', 10],
    ['コゲクサ', 6],
    ['貯ミツアリ', 6],
  ]),
  r('2', c.ARMOUR, '風来人のシャツ', ['B', 'P', 'R'], [
    ['ペントナイト', 10],
    ['パチパチ水', 6],
    ['白灰砂', 6],
  ]),
  r('2', c.JEWELRY, '精霊の首飾り', ['B', 'P', 'G'], [
    ['自然油', 10],
    ['チョウチョウウオ', 6],
    ['フェスト', 6],
  ]),
  r('2', c.ATTACK, 'クラフト', ['B', 'R', 'G'], [
    ['綿毛草', 30],
  ]),
  r('2', c.WEAPON, 'バトルアクス', ['P', 'Y', 'R'], [
    ['アオツメクサ', 10],
    ['スイートリーフ', 1],
    ['セイタカトーン', 2],
  ]),
  r('2', c.ARMOUR, 'ハードコート', ['B', 'P', 'G'], [
    ['貯ミツアリ', 10],
    ['星テントウ', 1],
    ['マジックグラス', 2],
  ]),
  r('2', c.JEWELRY, 'ルーンストーン', ['B', 'Y', 'R'], [
    ['フェスト', 10],
    ['スティム鋼石', 1],
    ['銀のハチの巣', 2],
  ]),
  r('2', c.BUFF, 'ウォーパウダー', ['B', 'R', 'G'], [
    ['蓮', 2],
    ['うにゾウムシ', 1],
    ['黒水', 1],
  ]),
  r('2', c.BUFF, '神秘の羽衣', ['P', 'Y', 'R'], [
    ['コベリナイト', 15],
    ['自然油', 15],
    ['綿毛草', 15],
  ]),
  r('2', c.WEAPON, '癒しの杖', ['B', 'Y', 'G'], [
    ['綿毛草', 10],
    ['食毒草', 10],
    ['スイートリーフ', 1],
  ]),
  r('2', c.ARMOUR, 'ボルダースケイル', ['P', 'Y', 'R'], [
    ['コベリナイト', 10],
    ['キラービー', 10],
    ['星テントウ', 1],
  ]),
  r('2', c.JEWELRY, 'クォーツネックレス', ['P', 'Y', 'R'], [
    ['自然油', 10],
    ['ビリビリ水', 10],
    ['スティム鋼石', 1],
  ]),

  r('3', c.ATTACK, 'たたかう魔剣', ['B', 'P', 'Y'], [
    ['灯火草', 10],
    ['苦ミミズ', 10],
    ['エメラルドグラス', 10],
  ]),
  r('3', c.WEAPON, '白銀の双剣', ['B', 'P', 'Y'], [
    ['灯火草', 10],
    ['雲海の隠れ家', 20],
  ]),
  r('3', c.ARMOUR, 'ナイトシェイド', ['P', 'Y', 'G'], [
    ['灯火草', 10],
    ['闇の雫', 20],
  ]),
  r('3', c.JEWELRY, 'グナーデリング・物', ['B', 'P', 'G'], [
    ['インゴットバグ', 2],
    ['丈夫なつる', 4],
    ['スカイバブル', 4],
  ]),
  r('3', c.JEWELRY, 'グナーデリング・魔', ['B', 'P', 'Y'], [
    ['聖樹の大枝', 2],
    ['丈夫なつる', 4],
    ['魔石の欠片', 4],
  ]),
  r('3', c.JEWELRY, '闘志のマフラー', ['Y', 'R', 'G'], [
    ['灯火草', 10],
    ['風船魚', 20],
  ]),
  r('3', c.BUFF, 'スモークミート', ['B', 'P', 'R'], [
    ['赤い花', 10],
    ['セリヨル', 7],
    ['エメラルドグラス', 7],
  ]),
  r('3', c.DEBUFF, '不幸の瓶詰め', ['B', 'P', 'G'], [
    ['赤い花', 10],
    ['アイヒェ', 7],
    ['震える結晶', 7],
  ]),
  r('3', c.WEAPON, 'クレアエンパシー', ['B', 'Y', 'G'], [
    ['赤い花', 10],
    ['樹氷石', 10],
    ['アイヒェ', 10],
  ]),
  r('3', c.ARMOUR, '極彩色のローブ', ['B', 'P', 'Y'], [
    ['剛鉄鉱', 2],
    ['エグゾフィッシュ', 2],
    ['魔石の欠片', 4],
  ]),
  r('3', c.ARMOUR, 'コンバットシャツ', ['B', 'P', 'R'], [
    ['パルマ', 2],
    ['蒼剛石', 2],
    ['スカイバブル', 4],
  ]),
  r('3', c.WEAPON, 'シュペーヴァイス', ['Y', 'R', 'G'], [
    ['赤い花', 10],
    ['セリヨル', 15],
  ]),
  r('3', c.BUFF, 'エネルジアニカ', ['B', 'Y', 'R'], [
    ['セイタカトーン', 20],
    ['魔石の欠片', 4],
    ['モルディナイト', 2],
  ]),
  r('3', c.ATTACK, 'ローゼフラム', ['B', 'Y', 'R'], [
    ['赤砂', 10],
    ['蓮', 20],
  ]),
  r('3', c.BUFF, '妙薬ドラッヘン', ['Y', 'R', 'G'], [
    ['赤砂', 10],
    ['幸せクローバー', 2],
    ['ベビーヴルム', 2],
  ]),
  r('3', c.WEAPON, '精霊の杖・火', ['B', 'P', 'R'], [
    ['赤砂', 5],
    ['スイートリーフ', 15],
  ]),
  r('3', c.WEAPON, '精霊の杖・氷', ['B', 'P', 'Y'], [
    ['赤砂', 5],
    ['星テントウ', 15],
  ]),
  r('3', c.WEAPON, '精霊の杖・雷', ['B', 'P', 'Y'], [
    ['赤砂', 5],
    ['星テントウ', 15],
  ]),
  r('3', c.WEAPON, '精霊の杖・風', ['P', 'R', 'G'], [
    ['赤砂', 5],
    ['スティム鋼石', 15],
  ]),
  r('3', c.DEBUFF, '燃える水', ['Y', 'R', 'G'], [
    ['きれいな水', 15],
    ['うにゾウムシ', 10],
  ]),
  r('3', c.BUFF, '錬金キャンディ', ['B', 'P', 'Y'], [
    ['セリヨル', 15],
    ['黒水', 10],
  ]),
  r('3', c.JEWELRY, '熱血はちまき', ['P', 'Y', 'G'], [
    ['クスリゴケ', 5],
    ['アイヒェ', 15],
  ]),
  r('3', c.ARMOUR, '無重力シャツ', ['Y', 'R', 'G'], [
    ['きれいな水', 10],
    ['水底の水', 2],
    ['幸せクローバー', 2],
  ]),
  r('3', c.JEWELRY, 'エンゼルチャーム', ['B', 'R', 'G'], [
    ['クスリゴケ', 10],
    ['アイヒェ', 10],
    ['セリヨル', 10],
  ]),
  r('3', c.ARMOUR, '冒険者の服', ['P', 'Y', 'G'], [
    ['セリヨル', 10],
    ['トゲトゲ', 2],
    ['ベビーヴルム', 2],
  ]),
  r('3', c.ARMOUR, '鋲打ちの皮鎧', ['B', 'Y', 'G'], [
    ['アイヒェ', 10],
    ['乾いた木くず', 2],
    ['モルディナイト', 2],
  ]),
  r('3', c.JEWELRY, 'ハッスルベルト', ['B', 'Y', 'R'], [
    ['クスリゴケ', 10],
    ['アイヒェ', 10],
    ['きれいな水', 10],
  ]),
  r('3', c.JEWELRY, 'エンゼルリボン', ['B', 'P', 'R'], [
    ['水底の水', 2],
    ['トゲトゲ', 2],
    ['乾いた木くず', 2],
  ]),
  r('3', c.ARMOUR, '魔獣の革鎧', ['B', 'P', 'R'], [
    ['うにゾウムシ', 10],
    ['黒水', 10],
    ['水底の水', 2],
  ]),
  r('3', c.BUFF, '黄金エキススープ', ['Y', 'R', 'G'], [
    ['赤砂', 20],
    ['クスリゴケ', 20],
    ['スカイバブル', 4],
  ]),
  r('3', c.HEAL, 'エリキシル剤', ['B', 'Y', 'R'], [
    ['エスプラント', 2],
    ['月イナゴ', 2],
    ['ミネラル液晶', 2],
  ]),

  r('4', c.BUFF, '妖薬エボニアル', ['B', 'Y', 'G'], [
    ['ローズビー', 40],
    ['輝く水晶のカケラ', 5],
  ]),
  r('4', c.WEAPON, '波打つ刺剣', ['R', 'B', 'P'], [
    ['ローズビー', 40],
    ['砂晶石', 5],
  ]),
  r('4', c.WEAPON, 'クレプスクルン', ['P', 'Y', 'G'], [
    ['首垂れ草', 30],
    ['ラプチャー', 5],
    ['スーメック', 2]
  ]),
  r('4', c.JEWELRY, '神速のブーツ', ['R', 'B', 'G'], [
    ['首垂れ草', 30],
    ['香木のくず', 5],
    ['聖なるねじれ樹', 2]
  ]),
  r('4', c.JEWELRY, 'ミシカルリング', ['B', 'P', 'Y'], [
    ['首垂れ草', 30],
    ['砕けた石材', 5],
    ['ルインストン', 2]
  ]),
  r('4', c.ATTACK, '廻る魔剣', ['R', 'G', 'P'], [
    ['ラプチャー', 8],
    ['香木のくず', 8],
    ['砕けた石材', 8],
  ]),
  r('4', c.ARMOUR, '雷鳴の鎧', ['B', 'P', 'G'], [
    ['紫紺の雫', 40],
    ['ラプチャー', 5],
    ['朽ちた樹の枯れ枝', 1]
  ]),
  r('4', c.ARMOUR, 'ベルベットレイヤード・斬', ['R', 'B', 'Y'], [
    ['紫紺の雫', 40],
    ['スキマグサ', 5],
    ['朽ちた樹の大枝', 1]
  ]),
  r('4', c.ARMOUR, '氷霧の鎧', ['P', 'Y', 'R'], [
    ['オレンジグラス', 40],
    ['香木のくず', 5],
    ['古代魚', 1]
  ]),
  r('4', c.ARMOUR, 'ベルベットレイヤード・打', ['Y', 'R', 'G'], [
    ['オレンジグラス', 40],
    ['スキマグサ', 5],
    ['朽ちた樹の枯れ枝', 1]
  ]),
  r('4', c.HEAL, 'トランヒールサルヴ', ['B', 'P', 'G'], [
    ['朽ちた樹の大枝', 2],
    ['古代魚', 2],
    ['朽ちた樹の枯れ枝', 1],
  ]),

  r('5', c.BUFF, 'プロテクトパウダー', ['R', 'Y', 'G'], [
    ['ファニプラント', 30],
    ['ジェムフライ', 10],
  ]),
  r('5', c.WEAPON, 'まじないほうき', ['P', 'R', 'G'], [
    ['ファニプラント', 30],
    ['灯篭ホタル', 10],
  ]),
  r('5', c.WEAPON, 'メタルターナー', ['Y', 'B', 'R'], [
    ['酸いの実', 20],
    ['ホシナナ', 5],
    ['スピリト・モルグ', 3],
  ]),
  r('5', c.BUFF, '神秘のタリスマン', ['P', 'R', 'G'], [
    ['酸いの実', 20],
    ['赤曜鉱', 5],
    ['赤玉鉱石', 3],
  ]),
  r('5', c.JEWELRY, '羽飾り', ['R', 'B', 'P'], [
    ['酸いの実', 20],
    ['マグマパウダー', 5],
    ['炭化樹皮', 3],
  ]),
  r('5', c.ATTACK, 'シュタルレヘルン', ['G', 'Y', 'P'], [
    ['ホシナナ', 8],
    ['マグマパウダー', 8],
    ['赤曜鉱', 8],
  ]),
  r('5', c.ARMOUR, 'さすらい人の服', ['Y', 'R', 'P'], [
    ['アイヒェロア', 30],
    ['ホシナナ', 5],
    ['トキシーアント', 2],
  ]),
  r('5', c.ARMOUR, '薬草のポンチョ', ['G', 'B', 'Y'], [
    ['アイヒェロア', 30],
    ['紅草', 5],
    ['灰かぶり草', 2],
  ]),
  r('5', c.ARMOUR, 'オーレスケイル', ['G', 'Y', 'P'], [
    ['ハイネの炎石', 30],
    ['赤曜鉱', 5],
    ['赤熱結晶', 2],
  ]),
  r('5', c.ARMOUR, 'デイフーガ', ['P', 'B', 'G'], [
    ['ハイネの炎石', 30],
    ['ホシナナ', 5],
    ['トキシーアント', 2],
  ]),
  r('5', c.BUFF, 'カクテルレープ', ['Y', 'B', 'R'], [
    ['灰かぶり草', 2],
    ['赤熱結晶', 2],
    ['トキシーアント', 1],
  ]),

  r('EX1', c.ATTACK, 'レーツェルフト', ['P', 'Y', 'G'], [
    ['蒼剛石', 10],
    ['パルマの実', 10],
    ['輝く水晶のカケラ', 5],
  ]),
  r('EX1', c.ATTACK, '創世の槌', ['P', 'Y', 'R'], [
    ['エグゾフィッシュ', 10],
    ['琥珀水晶', 10],
    ['輝く水晶のカケラ', 5],
  ]),
  r('EX1', c.ATTACK, 'リュミエールランス', ['B', 'R', 'G'], [
    ['パルマ', 10],
    ['ワームフィッシュ', 10],
    ['砂晶石', 5],
  ]),
  r('EX1', c.ATTACK, 'クライトレヘルン', ['B', 'P', 'R'], [
    ['エグゾフィッシュ', 10],
    ['琥珀水晶', 10],
    ['砂晶石', 5],
  ]),
  r('EX1', c.ATTACK, 'シュトラプラジグ', ['B', 'Y', 'G'], [
    ['パルマ', 10],
    ['パルマの実', 10],
    ['輝く水晶のカケラ', 5],
  ]),
  r('EX1', c.JEWELRY, 'クロニクルマーク・突', ['B', 'R', 'G'], [
    ['聖樹の大枝', 15],
    ['スカイバブル', 20],
    ['魔石の欠片', 20],
  ]),
  r('EX1', c.JEWELRY, 'クロニクルマーク・斬', ['P', 'Y', 'G'], [
    ['インゴットバグ', 15],
    ['丈夫なつる', 20],
    ['魔石の欠片', 20],
  ]),
  r('EX1', c.JEWELRY, 'クロニクルマーク・打', ['Y', 'R', 'G'], [
    ['剛鉄鉱', 15],
    ['丈夫なつる', 20],
    ['スカイバブル', 20],
  ]),
  r('EX1', c.JEWELRY, '暴風のリング', ['B', 'P', 'G'], [
    ['インゴットバグ', 15],
    ['琥珀水晶', 10],
  ]),
  r('EX1', c.JEWELRY, '火霊のリング', ['B', 'P', 'Y'], [
    ['聖樹の大枝', 15],
    ['ワームフィッシュ', 10],
  ]),
  r('EX1', c.JEWELRY, '氷幻のリング', ['B', 'Y', 'G'], [
    ['聖樹の大枝', 15],
    ['ワームフィッシュ', 10],
  ]),
  r('EX1', c.JEWELRY, '雷帝のリング', ['B', 'P', 'Y'], [
    ['剛鉄鉱', 15],
    ['パルマの実', 10],
  ]),
  r('EX1', c.WEAPON, '守護者の大剣', ['Y', 'R', 'G'], [
    ['水底の水', 15],
    ['レピアフィッシュ', 2],
    ['砂晶石', 5],
  ]),
  r('EX1', c.WEAPON, 'おしゃれなほうき', ['B', 'P', 'G'], [
    ['トゲトゲ', 15],
    ['パルマ樹皮', 2],
    ['輝く水晶のカケラ', 5],
  ]),
  r('EX1', c.BUFF, 'トリトンのほら貝', ['B', 'R', 'G'], [
    ['琥珀水晶', 7],
    ['パルマ樹皮', 3],
  ]),
  r('EX1', c.BUFF, '肉体活性の粉末', ['B', 'Y', 'R'], [
    ['ワームフィッシュ', 7],
    ['甘露の湧水', 3],
  ]),
  r('EX1', c.BUFF, '剛力の塗り薬', ['B', 'P', 'G'], [
    ['パルマの実', 7],
    ['レピアフィッシュ', 3],
  ]),
  r('EX1', c.ARMOUR, 'レディアントプレート', ['B', 'Y', 'G'], [
    ['ベビーヴルム', 15],
    ['丈夫なつる', 25],
    ['魔石の欠片', 25],
  ]),
  r('EX1', c.ARMOUR, 'スカラーコート', ['P', 'Y', 'R'], [
    ['モルディナイト', 15],
    ['魔石の欠片', 25],
    ['スカイバブル', 25],
  ]),
  r('EX1', c.BUFF, '風繰り車', ['P', 'Y', 'R'], [
    ['幸せクローバー', 20],
    ['甘露の湧水', 3],
  ]),
  r('EX1', c.BUFF, 'シュネーシュトルム', ['B', 'P', 'G'], [
    ['ベビーヴルム', 20],
    ['レピアフィッシュ', 3],
  ]),
  r('EX1', c.ARMOUR, '薬草のシャツ', ['B', 'P', 'R'], [
    ['モルディナイト', 15],
    ['砂晶石', 5],
    ['魔石の欠片', 20],
  ]),
  r('EX1', c.BUFF, 'レッドウォーパウダー', ['B', 'Y', 'G'], [
    ['甘露の湧水', 3],
    ['パルマ樹皮', 3],
  ]),
  r('EX1', c.BUFF, '雷の呼び鈴', ['P', 'Y', 'R'], [
    ['琥珀水晶', 7],
    ['ワームフィッシュ', 7],
  ]),
  r('EX1', c.HEAL, 'リストレア薬瓶', ['B', 'P', 'Y'], [
    ['聖樹結晶', 5],
    ['ラピス・パピヨン', 5],
    ['ゴルディナイト', 5],
  ]),
  r('EX1', c.ARMOUR, 'プレートベスト', ['B', 'Y', 'R'], [
    ['セイタカトーン', 50],
    ['魔石の欠片', 50],
    ['輝く水晶のカケラ', 30],
  ]),
  r('EX1', c.WEAPON, 'クリングメーネ', ['B', 'P', 'Y'], [
    ['三つ子トーン', 20],
    ['安らぎの花', 30],
    ['誘惑の溶樹液', 10],
  ]),
  r('EX1', c.DEBUFF, 'かぼちゃドール', ['P', 'R', 'G'], [
    ['千日草', 10],
    ['誘惑の溶樹液', 10],
    ['湖底のぬし', 10],
  ]),
  r('EX1', c.WEAPON, 'ヤマネコの槍', ['B', 'Y', 'R'], [
    ['三つ子トーン', 20],
    ['金のハチの巣', 30],
    ['エスプラント', 10],
  ]),
  r('EX1', c.WEAPON, 'フォーチュンライト', ['B', 'P', 'G'], [
    ['リュウソウラン', 20],
    ['彗星岩', 20],
    ['ラピス・パピヨン', 10],
  ]),
  r('EX1', c.WEAPON, '陽だまりの杖', ['P', 'R', 'G'], [
    ['大木のツタ', 15],
    ['彗星岩', 15],
    ['ほたる火草', 3],
  ]),
  r('EX1', c.WEAPON, '修練の道標', ['B', 'P', 'Y'], [
    ['光る砂', 5],
    ['太陽の花', 5],
    ['メイスフィッシュ', 3],
  ]),
  r('EX1', c.WEAPON, 'エレメントブレス・火', ['B', 'R', 'G'], [
    ['光る砂', 10],
    ['太陽の花', 10],
    ['ソーンフィッシュ', 3],
  ]),
  r('EX1', c.WEAPON, 'エレメントブレス・雷', ['B', 'R', 'G'], [
    ['銀のハチの巣', 60],
    ['丈夫なつる', 60],
    ['輝く水晶のカケラ', 60],
  ]),
  r('EX1', c.WEAPON, 'エレメントブレス・氷', ['P', 'Y', 'R'], [
    ['マジックグラス', 60],
    ['スカイバブル', 60],
    ['砂晶石', 60],
  ]),
  // r('EX1', c.WEAPON, '白翼の槍', ['', '', ''], [
  //   ['安らぎの花', 20],
  //   ['金のハチの巣', 20],
  //   ['ミネラル液晶', 20],
  // ]),
  r('EX1', c.DEBUFF, 'イバラの抱擁', ['B', 'P', 'Y'], [
    ['エスプラント', 10],
    ['月イナゴ', 10],
    ['ミネラル液晶', 10],
  ]),
  r('EX1', c.ARMOUR, '精霊のローブ', ['B', 'Y', 'R'], [
    ['セイタカトーン', 80],
    ['マジックグラス', 80],
    ['銀のハチの巣', 80],
  ]),
  r('EX1', c.ARMOUR, '旅の羽衣', ['P', 'B', 'G'], [
    ['魔石の欠片', 80],
    ['砂晶石', 40],
    ['輝く水晶のカケラ', 40],
  ]),
  // r('EX1', c.WEAPON, 'ワンダーミステル・火', ['', '', ''], [
  //   ['リュウソウラン', 20],
  //   ['大木のツタ', 30],
  //   ['剛鉄鉱', 30],
  // ]),
  r('EX1', c.DEBUFF, '氷びし', ['B', 'Y', 'P'], [
    ['ほたる火草', 7],
    ['アンバーフライ', 7],
    ['黒陽鉱', 7],
  ]),
  r('EX1', c.WEAPON, 'ワンダーミステル・風', ['Y', 'R', 'G'], [
    ['リュウソウラン', 20],
    ['彗星岩', 30],
    ['アンバーフライ', 10],
  ]),
  // r('EX1', c.WEAPON, 'ワンダーミステル・氷', ['', '', ''], [
  //   ['光る砂', 30],
  //   ['太陽の花', 20],
  //   ['甘露の実', 5],
  // ]),
  r('EX1', c.DEBUFF, 'ブリッツコア', ['P', 'Y', 'R'], [
    ['太古の蒼水', 2],
    ['ソーンフィッシュ', 2],
    ['エヴィヒブラウ', 2],
  ]),
  r('EX1', c.WEAPON, 'ワンダーミステル・雷', ['B', 'Y', 'R'], [
    ['光る砂', 20],
    ['太陽の花', 30],
    ['太古の蒼水', 2],
  ]),
  // r('EX1', c.DEBUFF, '生きてるゴミ箱', ['', '', ''], [
  //   ['三つ子トーン', 25],
  //   ['大木のツタ', 25],
  //   ['光る砂', 25],
  // ]),
  r('EX1', c.ARMOUR, '銀糸の鎧', ['B', 'R', 'G'], [
    ['安らぎの花', 25],
    ['リュウソウラン', 25],
    ['光る砂', 25],
  ]),
  // r('EX1', c.ARMOUR, 'ファーデンコート', ['', '', ''], [
  //   ['金のハチの巣', 25],
  //   ['彗星岩', 25],
  //   ['太陽の花', 25],
  // ]),
  // r('EX1', c.ARMOUR, 'ゴールドジャケット', ['', '', ''], [
  //   ['金のハチの巣', 25],
  //   ['大木のツタ', 25],
  //   ['太陽の花', 25],
  // ]),
  r('EX1', c.ARMOUR, '金刺繍のコート', ['B', 'P', 'Y'], [
    ['安らぎの花', 25],
    ['リュウソウラン', 25],
    ['光る砂', 25],
  ]),
  r('EX1', c.ARMOUR, 'シャレードルマント', ['P', 'R', 'G'], [
    ['三つ子トーン', 25],
    ['彗星岩', 25],
    ['太陽の花', 25],
  ]),
  r('EX1', c.DEBUFF, 'ヒロイックガイスト', ['B', 'P', 'Y'], [
    ['永遠結晶', 10],
    ['千日草', 10],
    ['聖樹結晶', 10],
  ]),

  r('EX2', c.ATTACK, 'ドナークリスタル', ['R', 'Y', 'G'], [
    ['ジェムフライ', 5],
    ['ルインストン', 10],
    ['ルインフィッシュ', 2],
  ]),
  r('EX2', c.BUFF, '破壊の秘薬', ['P', 'B', 'Y'], [
    ['灯篭ホタル', 5],
    ['聖なるねじれ樹', 10],
    ['派手な石材', 2],
  ]),
  r('EX2', c.WEAPON, '鋼鉄弓', ['G', 'R', 'P'], [
    ['スーメック', 15],
    ['邪なるねじれ樹', 3],
  ]),
  r('EX2', c.WEAPON, 'フローリッシュハート', ['B', 'P', 'Y'], [
    ['朽ちた樹の枯れ枝', 10],
    ['古代魚', 10],
    ['朽ちた樹の大枝', 10],
  ]),
  // r('EX2', c.ARMOUR, '炎熱の鎧', ['', '', ''], [
  //   ['ルインフィッシュ', 2],
  //   ['ブランチトランク', 5],
  //   ['ツドイグサ', 5],
  // ]),
  // r('EX2', c.ARMOUR, '風凪の鎧', ['', '', ''], [
  //   ['邪なるねじれ樹', 2],
  //   ['正体不明の輝石', 5],
  //   ['ブラストフィッシュ', 5],
  // ]),
  // r('EX2', c.ARMOUR, 'ベルベットレイヤード・突', ['', '', ''], [
  //   ['派手な石材', 2],
  //   ['チョウロウウオ', 5],
  //   ['幻惑の木片', 5],
  // ]),
  r('EX2', c.JEWELRY, '白熱はちまき', ['B', 'P', 'Y'], [
    ['激憤の叫び', 10],
    ['霊魂宝珠', 10],
  ]),
  r('EX2', c.JEWELRY, 'グローリーベルト', ['Y', 'R', 'G'], [
    ['導きの花', 2],
    ['太古の聖魚', 2],
    ['太古の老木', 2],
  ]),

  r('EX3', c.ATTACK, 'ラーヴァキューブ', ['R', 'Y', 'G'], [
    ['プルムル', 5],
    ['スピリト・モルグ', 10],
    ['モノノフバッタ', 2],
  ]),
  r('EX3', c.WEAPON, 'ラギーソード', ['R', 'G', 'Y'], [
    ['灰かぶり草', 10],
    ['トキシーアント', 10],
    ['赤熱結晶', 10],
  ]),
  r('EX3', c.WEAPON, 'コールドハンマー', ['G', 'Y', 'P'], [
    ['赤玉鉱石', 15],
    ['フロジストン', 3],
  ]),
  r('EX3', c.BUFF, '詰め合わせキャンディ', ['R', 'B', 'G'], [
    ['ザフロア油', 5],
    ['炭化樹皮', 10],
    ['シュランク', 2],
  ]),
  // r('EX3', c.ARMOUR, 'スケイルアーマー', ['', '', ''], [
  //   ['フラムドラグーン', 1],
  //   ['モノノフバッタ', 3],
  //   ['スピアワーム', 3],
  // ]),
  // r('EX3', c.ARMOUR, 'ナチュラルコート', ['', '', ''], [
  //   ['聖石の欠片', 1],
  //   ['黒玉鉱石', 3],
  //   ['フロジストン', 3],
  // ]),
  // r('EX3', c.ARMOUR, 'ダークレザー', ['', '', ''], [
  //   ['溶けあう硬木', 1],
  //   ['シュランク', 3],
  //   ['ブルリエーレ', 3],
  // ]),
  // r('EX3', c.JEWELRY, 'オルフィックリング・雷', ['', '', ''], [
  //   ['ヴァイヒ', 1],
  //   ['老木の枝葉', 1],
  //   ['フェロス・モルグ', 1],
  // ]),
  // r('EX3', c.JEWELRY, 'オルフィックリング・氷', ['', '', ''], [
  //   ['煌めく砂', 5],
  //   ['恩寵の淑女', 5],
  // ]),

  r('ザールブルグの錬金術師', c.WEAPON, '鋼の杖', ['G', 'P', 'Y'], [
    ['オニワライタケ', 20],
  ]),
  r('ザールブルグの錬金術師', c.WEAPON, 'ミーミルの杖', ['B', 'Y', 'R'], [
    ['オニワライタケ', 20],
  ]),
  r('ザールブルグの錬金術師', c.ARMOUR, '鋼の鎧', ['G', 'R', 'Y'], [
    ['こじょのこしかけ', 20],
  ]),
  r('ザールブルグの錬金術師', c.ARMOUR, '輝く絹の服', ['B', 'Y', 'P'], [
    ['こじょのこしかけ', 20],
  ]),
  r('ザールブルグの錬金術師', c.JEWELRY, 'パルフューム', ['G', 'R', 'B'], [
    ['レジエン石', 20],
  ]),
  r('ザールブルグの錬金術師', c.JEWELRY, '安らぎのマフラー', ['R', 'B', 'P'], [
    ['レジエン石', 20],
  ]),

  r('300万DL記念', c.WEAPON, 'プリンセスステッキ', ['P', 'Y', 'G'], [
    ['黄金うにの枝', 10],
  ]),
  r('300万DL記念', c.ARMOUR, 'プリンセスドレス', ['B', 'P', 'Y'], [
    ['聖銀石', 10],
  ]),
  r('300万DL記念', c.JEWELRY, 'プリンセスティアラ', ['P', 'R', 'G'], [
    ['黄金うにの枝', 5],
    ['聖銀石', 5],
  ]),
  r('300万DL記念', c.WEAPON, '勇者の剣', ['B', 'R', 'G'], [
    ['黄金うにの枝', 10],
  ]),
  r('300万DL記念', c.ARMOUR, '勇者の鎧', ['B', 'P', 'Y'], [
    ['聖銀石', 10],
  ]),
  r('300万DL記念', c.JEWELRY, '勇者のお守り', ['B', 'Y', 'R'], [
    ['黄金うにの枝', 5],
    ['聖銀石', 5],
  ]),

  r('決戦！ハロウィンぷに', c.JEWELRY, '魔女のお面', ['R', 'P', 'B'], [
    ['ハロウィンパンプキン', 20],
  ]),
  r('決戦！ハロウィンぷに', c.WEAPON, '魔女の剣', ['B', 'G', 'R'], [
    ['ハロウィンパンプキン', 20],
  ]),
  r('決戦！ハロウィンぷに', c.ARMOUR, '魔女の服', ['Y', 'R', 'P'], [
    ['ハロウィンパンプキン', 20],
  ]),
  r('決戦！ハロウィンぷに', c.JEWELRY, '吸血鬼のブローチ', ['Y', 'G', 'B'], [
    ['ハロウィンパンプキン', 20],
  ]),
  r('決戦！ハロウィンぷに', c.WEAPON, '吸血鬼の杖', ['P', 'Y', 'G'], [
    ['ハロウィンパンプキン', 20],
  ]),
  r('決戦！ハロウィンぷに', c.ARMOUR, '吸血鬼のマント', ['G', 'B', 'R'], [
    ['ハロウィンパンプキン', 20],
  ]),

  r('リディー＆スールの日常', c.WEAPON, 'ビギナースタッフ', ['P', 'R', 'G'], [
    ['星の花', 20],
  ]),
  r('リディー＆スールの日常', c.WEAPON, 'ブラッディクロー', ['B', 'Y', 'G'], [
    ['星の花', 20],
  ]),
  r('リディー＆スールの日常', c.ARMOUR, '幻月の服', ['B', 'P', 'R'], [
    ['星の実', 20],
  ]),
  r('リディー＆スールの日常', c.ARMOUR, 'ハードローブ', ['B', 'Y', 'R'], [
    ['星の実', 20],
  ]),
  r('リディー＆スールの日常', c.JEWELRY, 'ナックルガード', ['B', 'P', 'Y'], [
    ['星の花', 10],
    ['星の実', 10],
  ]),
  r('リディー＆スールの日常', c.JEWELRY, 'アンジュパリュール', ['P', 'Y', 'G'], [
    ['星の花', 10],
    ['星の実', 10],
  ]),
  r('リディー＆スールの日常', c.ATTACK, 'さすらう地球儀', ['Y', 'R', 'G'], [
    ['ハイネライト', 30],
  ]),
]

export default recipes;
